Model: "model_6"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 64, 64, 32)   320         input_7[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_30 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_42[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_30[0][0]           
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_31 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 32, 32, 144)  83088       conv2d_43[0][0]                  
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_31[0][0]           
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 32, 32, 176)  0           conv2d_44[0][0]                  
                                                                 conv2d_45[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_32 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_32[0][0]           
__________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_32[0][0]           
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 16, 16, 144)  83088       conv2d_46[0][0]                  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_33[0][0]           
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 16, 16, 176)  0           conv2d_47[0][0]                  
                                                                 conv2d_48[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_13[0][0]             
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 11264)        0           max_pooling2d_34[0][0]           
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 2)            22530       flatten_6[0][0]                  
==================================================================================================
Total params: 209,314
Trainable params: 209,250
Non-trainable params: 64
__________________________________________________________________________________________________
