Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 64, 64, 32)   832         input_6[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_35[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 32, 32, 144)  451728      conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_26[0][0]           
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 32, 32, 176)  0           conv2d_37[0][0]                  
                                                                 conv2d_38[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_27[0][0]           
__________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_27[0][0]           
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 16, 16, 144)  451728      conv2d_39[0][0]                  
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_28[0][0]           
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 16, 16, 176)  0           conv2d_40[0][0]                  
                                                                 conv2d_41[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_11[0][0]             
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 11264)        0           max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 2)            22530       flatten_5[0][0]                  
==================================================================================================
Total params: 947,106
Trainable params: 947,042
Non-trainable params: 64
__________________________________________________________________________________________________
