Model: "model_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 64, 64, 32)   320         input_9[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_40 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_56[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_40[0][0]           
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_41 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 32, 32, 144)  230544      conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_41[0][0]           
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 32, 32, 176)  0           conv2d_58[0][0]                  
                                                                 conv2d_59[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_16[0][0]             
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 16, 16, 144)  230544      conv2d_60[0][0]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_43[0][0]           
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 16, 16, 176)  0           conv2d_61[0][0]                  
                                                                 conv2d_62[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_17[0][0]             
__________________________________________________________________________________________________
flatten_8 (Flatten)             (None, 11264)        0           max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 2)            22530       flatten_8[0][0]                  
==================================================================================================
Total params: 504,226
Trainable params: 504,162
Non-trainable params: 64
__________________________________________________________________________________________________
