Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 32)   1600        input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 64)   2112        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 32, 32, 32)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 144)  230544      conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 176)  0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 16, 16, 176)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 16, 16, 176)  0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 144)  230544      conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 16, 16, 176)  0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 8, 8, 176)    0           concatenate_3[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 11264)        0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            22530       flatten_1[0][0]                  
==================================================================================================
Total params: 505,506
Trainable params: 505,442
Non-trainable params: 64
__________________________________________________________________________________________________
