Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 32)   320         input_3[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 144)  451728      conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 32, 176)  0           conv2d_16[0][0]                  
                                                                 conv2d_17[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 144)  451728      conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 16, 16, 176)  0           conv2d_19[0][0]                  
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_5[0][0]              
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 11264)        0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            22530       flatten_2[0][0]                  
==================================================================================================
Total params: 946,594
Trainable params: 946,530
Non-trainable params: 64
__________________________________________________________________________________________________
