Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 64, 64, 32)   832         input_5[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 32, 32, 144)  230544      conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 32, 176)  0           conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 16, 16, 144)  230544      conv2d_32[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 16, 16, 176)  0           conv2d_33[0][0]                  
                                                                 conv2d_34[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_9[0][0]              
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 11264)        0           max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 2)            22530       flatten_4[0][0]                  
==================================================================================================
Total params: 504,738
Trainable params: 504,674
Non-trainable params: 64
__________________________________________________________________________________________________
