Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 64, 64, 32)   832         input_4[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 32, 32, 32)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 32)   128         max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 64)   2112        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 32, 32, 32)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 32, 32, 144)  83088       conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 32, 32, 32)   1056        max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 32, 32, 176)  0           conv2d_23[0][0]                  
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 16, 16, 176)  0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 16, 16, 64)   11328       max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 16, 16, 176)  0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 144)  83088       conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 32)   5664        max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 16, 16, 176)  0           conv2d_26[0][0]                  
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 8, 8, 176)    0           concatenate_7[0][0]              
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 11264)        0           max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            22530       flatten_3[0][0]                  
==================================================================================================
Total params: 209,826
Trainable params: 209,762
Non-trainable params: 64
__________________________________________________________________________________________________
