Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 64)   640         input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 32, 32, 64)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 64)   256         max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 96)   6240        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 32, 32, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 208)  978640      conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 64)   4160        max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 272)  0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 16, 16, 272)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 96)   26208       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 16, 16, 272)  0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 208)  978640      conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 64)   17472       max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 16, 16, 272)  0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 8, 8, 272)    0           concatenate_3[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 17408)        0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            34818       flatten_1[0][0]                  
==================================================================================================
Total params: 2,047,074
Trainable params: 2,046,946
Non-trainable params: 128
__________________________________________________________________________________________________
